OpenFOAM/WFD_OpenFOAM/templates/compressible_forward_mrf/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       3456;
    }
    back
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       3616;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       3776;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       3840;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       3904;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       4064;
    }
)

// ************************************************************************* //
