OpenFOAM/WFD_OpenFOAM/templates/compressible_forward_mrf/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.965;
    }
    thermodynamics
    {
        Cp          __CP__;
        Hf          0;
    }
    transport
    {
        mu          __MU__;
        Pr          __PR__;
    }
}

// gamma=__GAMMA__, R=__R__ are recorded in case_info.json for post-processing.

// ************************************************************************* //
